<%

'DBstr="DSN=fxs"

'2.14上mssql数据库连接字段，数据库名，服务器地址，账户名，账户密码
DBstr="Driver={SQL Server};Database=fxsDB;Server=172.16.2.14;uid=sa;pwd=Cc-0463"
'2.11客流服务器数据库连接字段，
DBipva= "Driver={SQL Server};Database=IPVA_S0400_B1;Server=172.16.2.11;uid=cc;pwd=Cc-0463"

'声明24个大类的数组，dl存实际销售，dl2用来存单位万元的四舍五入后的值
dim dl(23),dl2(23)
'数组初始赋零用于以后计算中的判断
for i=0 to ubound(dl)
  dl(i)=0
next

'大类名字数组，名字等于富基中基础转存后对应的大类名称
dlname=array("001 化妆","002 珠宝","003 钟表眼镜","004 饰品","005 男鞋","006 女鞋","007 箱包","008 成熟装","009 青春装","010 女士内衣","011 男装","012 中性休闲","013 运动服饰","014 运动用品","015 儿童服饰及用品","016 针毛织品","017 家用电器","018 数码/摄照","019 文化办公","020 家居用品","021 图书音像","023 功能","024 精品","201 超市大类")

'声明21个精品品牌，jp实际销售，jp2四舍五入到万元
dim jp(19),jp2(19)
for i=0 to ubound(jp)
  jp(i)=0
next

'精品名称，最终出现在发送报表中的名字
jpnameshow=array("爱马仕","、卡地亚 ","、梵克雅宝 ","、香奈儿 ","、宝格丽 ","、劳力士 ","、欧米茄 ","、施华洛世奇 ","、GIADA ","、阿玛尼 ","、登喜路 ","、雅格狮丹 ","、奥德臣 ","、宝姿 ","、宝马 ","、布克兄弟 ","、都彭 ","、COACH ","、RIMOWA ","、MK ")
'精品名字数组，名字等于富基中基础转存后对应的精品专柜名称
jpname=array("024010013704 爱马仕","024010012092 卡地亚","024010012981 梵克雅宝","024010011584 CHANEL","024010014034 宝格丽","003010011799 劳力士","003010010818 欧米茄","004010011874 施华洛世奇","024020013756 GIADA","024020013552 ARMANI COLLEZIONI","024020011955 登喜路","024020013600 雅格狮丹","024020013629 奥德臣","011010011954 宝姿","011020013052 宝马","011010011710 布克兄弟","011010010359 都彭","024020013076 COACH","024020012770 RIMOWA","024020014302 MICHAEL KORS")



%>